wolfgangz2013/rt-thread/bsp/HC32F146x_STK/Libraries/CMSIS/HC32FM14/Include/HC32M140KX.h
#define bM0P_ADC_ADCTL_SCF                              *((volatile unsigned int*)(0x424E0000UL))
#define bM0P_ADC_ADCTL_PCF                              *((volatile unsigned int*)(0x424E0004UL))
#define bM0P_ADC_ADCTL_PCP                              *((volatile unsigned int*)(0x424E0008UL))
#define bM0P_ADC_ADCTL_REFS                             *((volatile unsigned int*)(0x424E0014UL))
#define bM0P_ADC_ADCTL_ALGN                             *((volatile unsigned int*)(0x424E0018UL))
#define bM0P_ADC_ADCTL_SP                               *((volatile unsigned int*)(0x424E001CUL))
#define bM0P_ADC_ADCINT_ADINT0E                         *((volatile unsigned int*)(0x424E0040UL))
#define bM0P_ADC_ADCINT_ADINT1E                         *((volatile unsigned int*)(0x424E0044UL))
#define bM0P_ADC_ADCINT_ADINT2E                         *((volatile unsigned int*)(0x424E0048UL))
#define bM0P_ADC_ADCINT_ADINT3E                         *((volatile unsigned int*)(0x424E004CUL))
#define bM0P_ADC_ADCINT_ADINT0F                         *((volatile unsigned int*)(0x424E0050UL))
#define bM0P_ADC_ADCINT_ADINT1F                         *((volatile unsigned int*)(0x424E0054UL))
#define bM0P_ADC_ADCINT_ADINT3F                         *((volatile unsigned int*)(0x424E005CUL))
#define bM0P_ADC_ADCINT_ADINT4E                         *((volatile unsigned int*)(0x424E0060UL))
#define bM0P_ADC_ADCINT_ADINT4F                         *((volatile unsigned int*)(0x424E0070UL))
#define bM0P_ADC_ADCSCTL_SCST                           *((volatile unsigned int*)(0x424E0100UL))
#define bM0P_ADC_ADCSCTL_SCTMEN                         *((volatile unsigned int*)(0x424E0104UL))
#define bM0P_ADC_ADCSCTL_RPT                            *((volatile unsigned int*)(0x424E0108UL))
#define bM0P_ADC_ADCSCTL_SMOD                           *((volatile unsigned int*)(0x424E010CUL))
#define bM0P_ADC_ADCSCTL_SCCLR                          *((volatile unsigned int*)(0x424E0110UL))
#define bM0P_ADC_ADCSCTL_SOV                            *((volatile unsigned int*)(0x424E0114UL))
#define bM0P_ADC_ADCSCTL_SCFUL                          *((volatile unsigned int*)(0x424E0118UL))
#define bM0P_ADC_ADCSCTL_SCEMP                          *((volatile unsigned int*)(0x424E011CUL))
#define bM0P_ADC_SFS_SDPTH0                             *((volatile unsigned int*)(0x424E0120UL))
#define bM0P_ADC_SFS_SDPTH1                             *((volatile unsigned int*)(0x424E0124UL))
#define bM0P_ADC_SFS_SDPTH2                             *((volatile unsigned int*)(0x424E0128UL))
#define bM0P_ADC_SFS_SDPTH3                             *((volatile unsigned int*)(0x424E012CUL))
#define bM0P_ADC_SFD_SCH0                               *((volatile unsigned int*)(0x424E0180UL))
#define bM0P_ADC_SFD_SCH1                               *((volatile unsigned int*)(0x424E0184UL))
#define bM0P_ADC_SFD_SCH2                               *((volatile unsigned int*)(0x424E0188UL))
#define bM0P_ADC_SFD_SCH3                               *((volatile unsigned int*)(0x424E018CUL))
#define bM0P_ADC_SFD_SCH4                               *((volatile unsigned int*)(0x424E0190UL))
#define bM0P_ADC_SFD_STRGM0                             *((volatile unsigned int*)(0x424E01A0UL))
#define bM0P_ADC_SFD_STRGM1                             *((volatile unsigned int*)(0x424E01A4UL))
#define bM0P_ADC_SFD_SVLD                               *((volatile unsigned int*)(0x424E01B0UL))
#define bM0P_ADC_SFD_SFD0                               *((volatile unsigned int*)(0x424E01D0UL))
#define bM0P_ADC_SFD_SFD1                               *((volatile unsigned int*)(0x424E01D4UL))
#define bM0P_ADC_SFD_SFD2                               *((volatile unsigned int*)(0x424E01D8UL))
#define bM0P_ADC_SFD_SFD3                               *((volatile unsigned int*)(0x424E01DCUL))
#define bM0P_ADC_SFD_SFD4                               *((volatile unsigned int*)(0x424E01E0UL))
#define bM0P_ADC_SFD_SFD5                               *((volatile unsigned int*)(0x424E01E4UL))
#define bM0P_ADC_SFD_SFD6                               *((volatile unsigned int*)(0x424E01E8UL))
#define bM0P_ADC_SFD_SFD7                               *((volatile unsigned int*)(0x424E01ECUL))
#define bM0P_ADC_SFD_SFD8                               *((volatile unsigned int*)(0x424E01F0UL))
#define bM0P_ADC_SFD_SFD9                               *((volatile unsigned int*)(0x424E01F4UL))
#define bM0P_ADC_SFD_SFD10                              *((volatile unsigned int*)(0x424E01F8UL))
#define bM0P_ADC_SFD_SFD11                              *((volatile unsigned int*)(0x424E01FCUL))
#define bM0P_ADC_ADSIN0_CHSL0                           *((volatile unsigned int*)(0x424E0200UL))
#define bM0P_ADC_ADSIN0_CHSL1                           *((volatile unsigned int*)(0x424E0204UL))
#define bM0P_ADC_ADSIN0_CHSL2                           *((volatile unsigned int*)(0x424E0208UL))
#define bM0P_ADC_ADSIN0_CHSL3                           *((volatile unsigned int*)(0x424E020CUL))
#define bM0P_ADC_ADSIN0_CHSL4                           *((volatile unsigned int*)(0x424E0210UL))
#define bM0P_ADC_ADSIN0_CHSL5                           *((volatile unsigned int*)(0x424E0214UL))
#define bM0P_ADC_ADSIN0_CHSL6                           *((volatile unsigned int*)(0x424E0218UL))
#define bM0P_ADC_ADSIN0_CHSL7                           *((volatile unsigned int*)(0x424E021CUL))
#define bM0P_ADC_ADSIN0_CHSL8                           *((volatile unsigned int*)(0x424E0220UL))
#define bM0P_ADC_ADSIN0_CHSL9                           *((volatile unsigned int*)(0x424E0224UL))
#define bM0P_ADC_ADSIN0_CHSL10                          *((volatile unsigned int*)(0x424E0228UL))
#define bM0P_ADC_ADSIN0_CHSL11                          *((volatile unsigned int*)(0x424E022CUL))
#define bM0P_ADC_ADSIN0_CHSL12                          *((volatile unsigned int*)(0x424E0230UL))
#define bM0P_ADC_ADSIN0_CHSL13                          *((volatile unsigned int*)(0x424E0234UL))
#define bM0P_ADC_ADSIN0_CHSL14                          *((volatile unsigned int*)(0x424E0238UL))
#define bM0P_ADC_ADSIN0_CHSL15                          *((volatile unsigned int*)(0x424E023CUL))
#define bM0P_ADC_ADSIN1_SCHSL00                         *((volatile unsigned int*)(0x424E0200UL))
#define bM0P_ADC_ADSIN1_SCHSL01                         *((volatile unsigned int*)(0x424E0204UL))
#define bM0P_ADC_ADSIN1_SCHSL02                         *((volatile unsigned int*)(0x424E0208UL))
#define bM0P_ADC_ADSIN1_SCHSL03                         *((volatile unsigned int*)(0x424E020CUL))
#define bM0P_ADC_ADSIN1_SCHSL04                         *((volatile unsigned int*)(0x424E0210UL))
#define bM0P_ADC_ADSIN1_SCHSL10                         *((volatile unsigned int*)(0x424E0214UL))
#define bM0P_ADC_ADSIN1_SCHSL11                         *((volatile unsigned int*)(0x424E0218UL))
#define bM0P_ADC_ADSIN1_SCHSL12                         *((volatile unsigned int*)(0x424E021CUL))
#define bM0P_ADC_ADSIN1_SCHSL13                         *((volatile unsigned int*)(0x424E0220UL))
#define bM0P_ADC_ADSIN1_SCHSL14                         *((volatile unsigned int*)(0x424E0224UL))
#define bM0P_ADC_ADSIN1_SCHSL20                         *((volatile unsigned int*)(0x424E0228UL))
#define bM0P_ADC_ADSIN1_SCHSL21                         *((volatile unsigned int*)(0x424E022CUL))
#define bM0P_ADC_ADSIN1_SCHSL22                         *((volatile unsigned int*)(0x424E0230UL))
#define bM0P_ADC_ADSIN1_SCHSL23                         *((volatile unsigned int*)(0x424E0234UL))
#define bM0P_ADC_ADSIN1_SCHSL24                         *((volatile unsigned int*)(0x424E0238UL))
#define bM0P_ADC_ADSIN1_SCHSL30                         *((volatile unsigned int*)(0x424E023CUL))
#define bM0P_ADC_ADSIN1_SCHSL31                         *((volatile unsigned int*)(0x424E0240UL))
#define bM0P_ADC_ADSIN1_SCHSL32                         *((volatile unsigned int*)(0x424E0244UL))
#define bM0P_ADC_ADSIN1_SCHSL33                         *((volatile unsigned int*)(0x424E0248UL))
#define bM0P_ADC_ADSIN1_SCHSL34                         *((volatile unsigned int*)(0x424E024CUL))
#define bM0P_ADC_ADSIN1_SCHSL40                         *((volatile unsigned int*)(0x424E0250UL))
#define bM0P_ADC_ADSIN1_SCHSL41                         *((volatile unsigned int*)(0x424E0254UL))
#define bM0P_ADC_ADSIN1_SCHSL42                         *((volatile unsigned int*)(0x424E0258UL))
#define bM0P_ADC_ADSIN1_SCHSL43                         *((volatile unsigned int*)(0x424E025CUL))
#define bM0P_ADC_ADSIN1_SCHSL44                         *((volatile unsigned int*)(0x424E0260UL))
#define bM0P_ADC_ADSIN1_SCHSL50                         *((volatile unsigned int*)(0x424E0264UL))
#define bM0P_ADC_ADSIN1_SCHSL51                         *((volatile unsigned int*)(0x424E0268UL))
#define bM0P_ADC_ADSIN1_SCHSL52                         *((volatile unsigned int*)(0x424E026CUL))
#define bM0P_ADC_ADSIN1_SCHSL53                         *((volatile unsigned int*)(0x424E0270UL))
#define bM0P_ADC_ADSIN1_SCHSL54                         *((volatile unsigned int*)(0x424E0274UL))
#define bM0P_ADC_ADCPCTL_PCST                           *((volatile unsigned int*)(0x424E0300UL))
#define bM0P_ADC_ADCPCTL_PCTMEN                         *((volatile unsigned int*)(0x424E0304UL))
#define bM0P_ADC_ADCPCTL_EXTEN                          *((volatile unsigned int*)(0x424E0308UL))
#define bM0P_ADC_ADCPCTL_PCCLR                          *((volatile unsigned int*)(0x424E0310UL))
#define bM0P_ADC_ADCPCTL_POV                            *((volatile unsigned int*)(0x424E0314UL))
#define bM0P_ADC_ADCPCTL_PCFUL                          *((volatile unsigned int*)(0x424E0318UL))
#define bM0P_ADC_ADCPCTL_PCEMP                          *((volatile unsigned int*)(0x424E031CUL))
#define bM0P_ADC_PFS_PDPTH0                             *((volatile unsigned int*)(0x424E0320UL))
#define bM0P_ADC_PFS_PDPTH1                             *((volatile unsigned int*)(0x424E0324UL))
#define bM0P_ADC_PFD_PCH0                               *((volatile unsigned int*)(0x424E0380UL))
#define bM0P_ADC_PFD_PCH1                               *((volatile unsigned int*)(0x424E0384UL))
#define bM0P_ADC_PFD_PCH2                               *((volatile unsigned int*)(0x424E0388UL))
#define bM0P_ADC_PFD_PCH3                               *((volatile unsigned int*)(0x424E038CUL))
#define bM0P_ADC_PFD_PCH4                               *((volatile unsigned int*)(0x424E0390UL))
#define bM0P_ADC_PFD_PTRGM0                             *((volatile unsigned int*)(0x424E03A0UL))
#define bM0P_ADC_PFD_PTRGM1                             *((volatile unsigned int*)(0x424E03A4UL))
#define bM0P_ADC_PFD_PTRGM2                             *((volatile unsigned int*)(0x424E03A8UL))
#define bM0P_ADC_PFD_PVLD                               *((volatile unsigned int*)(0x424E03B0UL))
#define bM0P_ADC_PFD_PFD0                               *((volatile unsigned int*)(0x424E03D0UL))
#define bM0P_ADC_PFD_PFD1                               *((volatile unsigned int*)(0x424E03D4UL))
#define bM0P_ADC_PFD_PFD2                               *((volatile unsigned int*)(0x424E03D8UL))
#define bM0P_ADC_PFD_PFD3                               *((volatile unsigned int*)(0x424E03DCUL))
#define bM0P_ADC_PFD_PFD4                               *((volatile unsigned int*)(0x424E03E0UL))
#define bM0P_ADC_PFD_PFD5                               *((volatile unsigned int*)(0x424E03E4UL))
#define bM0P_ADC_PFD_PFD6                               *((volatile unsigned int*)(0x424E03E8UL))
#define bM0P_ADC_PFD_PFD7                               *((volatile unsigned int*)(0x424E03ECUL))
#define bM0P_ADC_PFD_PFD8                               *((volatile unsigned int*)(0x424E03F0UL))
#define bM0P_ADC_PFD_PFD9                               *((volatile unsigned int*)(0x424E03F4UL))
#define bM0P_ADC_PFD_PFD10                              *((volatile unsigned int*)(0x424E03F8UL))
#define bM0P_ADC_PFD_PFD11                              *((volatile unsigned int*)(0x424E03FCUL))
#define bM0P_ADC_ADPIN_L1CH0                            *((volatile unsigned int*)(0x424E0400UL))
#define bM0P_ADC_ADPIN_L1CH1                            *((volatile unsigned int*)(0x424E0404UL))
#define bM0P_ADC_ADPIN_L1CH2                            *((volatile unsigned int*)(0x424E0408UL))
#define bM0P_ADC_ADPIN_L1CH3                            *((volatile unsigned int*)(0x424E040CUL))
#define bM0P_ADC_ADPIN_L1CH4                            *((volatile unsigned int*)(0x424E0410UL))
#define bM0P_ADC_ADPIN_L2CH0                            *((volatile unsigned int*)(0x424E0420UL))
#define bM0P_ADC_ADPIN_L2CH1                            *((volatile unsigned int*)(0x424E0424UL))
#define bM0P_ADC_ADPIN_L2CH2                            *((volatile unsigned int*)(0x424E0428UL))
#define bM0P_ADC_ADPIN_L2CH3                            *((volatile unsigned int*)(0x424E042CUL))
#define bM0P_ADC_ADPIN_L2CH4                            *((volatile unsigned int*)(0x424E0430UL))
#define bM0P_ADC_ADCMPCTL_CMPCH0                        *((volatile unsigned int*)(0x424E0480UL))
#define bM0P_ADC_ADCMPCTL_CMPCH1                        *((volatile unsigned int*)(0x424E0484UL))
#define bM0P_ADC_ADCMPCTL_CMPCH2                        *((volatile unsigned int*)(0x424E0488UL))
#define bM0P_ADC_ADCMPCTL_CMPCH3                        *((volatile unsigned int*)(0x424E048CUL))
#define bM0P_ADC_ADCMPCTL_CMPCH4                        *((volatile unsigned int*)(0x424E0490UL))
#define bM0P_ADC_ADCMPCTL_CMPMD0                        *((volatile unsigned int*)(0x424E0494UL))
#define bM0P_ADC_ADCMPCTL_CMPMD1                        *((volatile unsigned int*)(0x424E0498UL))
#define bM0P_ADC_ADCMPCTL_CMPEN                         *((volatile unsigned int*)(0x424E049CUL))
#define bM0P_ADC_ADCMPD_CD0                             *((volatile unsigned int*)(0x424E04D8UL))
#define bM0P_ADC_ADCMPD_CD1                             *((volatile unsigned int*)(0x424E04DCUL))
#define bM0P_ADC_ADCMPD_CD2                             *((volatile unsigned int*)(0x424E04E0UL))
#define bM0P_ADC_ADCMPD_CD3                             *((volatile unsigned int*)(0x424E04E4UL))
#define bM0P_ADC_ADCMPD_CD4                             *((volatile unsigned int*)(0x424E04E8UL))
#define bM0P_ADC_ADCMPD_CD5                             *((volatile unsigned int*)(0x424E04ECUL))
#define bM0P_ADC_ADCMPD_CD6                             *((volatile unsigned int*)(0x424E04F0UL))
#define bM0P_ADC_ADCMPD_CD7                             *((volatile unsigned int*)(0x424E04F4UL))
#define bM0P_ADC_ADCMPD_CD8                             *((volatile unsigned int*)(0x424E04F8UL))
#define bM0P_ADC_ADCMPD_CD9                             *((volatile unsigned int*)(0x424E04FCUL))
#define bM0P_ADC_STSEL_STCH0                            *((volatile unsigned int*)(0x424E0500UL))
#define bM0P_ADC_STSEL_STCH1                            *((volatile unsigned int*)(0x424E0504UL))
#define bM0P_ADC_STSEL_STCH2                            *((volatile unsigned int*)(0x424E0508UL))
#define bM0P_ADC_STSEL_STCH3                            *((volatile unsigned int*)(0x424E050CUL))
#define bM0P_ADC_STSEL_STCH4                            *((volatile unsigned int*)(0x424E0510UL))
#define bM0P_ADC_STSEL_STCH5                            *((volatile unsigned int*)(0x424E0514UL))
#define bM0P_ADC_STSEL_STCH6                            *((volatile unsigned int*)(0x424E0518UL))
#define bM0P_ADC_STSEL_STCH7                            *((volatile unsigned int*)(0x424E051CUL))
#define bM0P_ADC_STSEL_STCH8                            *((volatile unsigned int*)(0x424E0520UL))
#define bM0P_ADC_STSEL_STCH9                            *((volatile unsigned int*)(0x424E0524UL))
#define bM0P_ADC_STSEL_STCH10                           *((volatile unsigned int*)(0x424E0528UL))
#define bM0P_ADC_STSEL_STCH11                           *((volatile unsigned int*)(0x424E052CUL))
#define bM0P_ADC_STSEL_STCH12                           *((volatile unsigned int*)(0x424E0530UL))
#define bM0P_ADC_STSEL_STCH13                           *((volatile unsigned int*)(0x424E0534UL))
#define bM0P_ADC_STSEL_STCH14                           *((volatile unsigned int*)(0x424E0538UL))
#define bM0P_ADC_STSEL_STCH15                           *((volatile unsigned int*)(0x424E053CUL))
#define bM0P_ADC_STS0_TM00                              *((volatile unsigned int*)(0x424E0600UL))
#define bM0P_ADC_STS0_TM01                              *((volatile unsigned int*)(0x424E0604UL))
#define bM0P_ADC_STS1_TM10                              *((volatile unsigned int*)(0x424E0620UL))
#define bM0P_ADC_STS1_TM11                              *((volatile unsigned int*)(0x424E0624UL))
#define bM0P_ADC_ADCDIV_DIV0                            *((volatile unsigned int*)(0x424E0680UL))
#define bM0P_ADC_ADCDIV_DIV1                            *((volatile unsigned int*)(0x424E0684UL))
#define bM0P_ADC_ADCDIV_DIV2                            *((volatile unsigned int*)(0x424E0688UL))
#define bM0P_ADC_ADCDIV_DIV3                            *((volatile unsigned int*)(0x424E068CUL))
#define bM0P_ADC_ADCDIV_DIV4                            *((volatile unsigned int*)(0x424E0690UL))
#define bM0P_ADC_ADCDIV_DIV5                            *((volatile unsigned int*)(0x424E0694UL))
#define bM0P_ADC_ADCDIV_DIV6                            *((volatile unsigned int*)(0x424E0698UL))
#define bM0P_ADC_ADCSTSL_STRGIN0                        *((volatile unsigned int*)(0x424E0700UL))
#define bM0P_ADC_ADCSTSL_STRGIN1                        *((volatile unsigned int*)(0x424E0704UL))
#define bM0P_ADC_ADCSTSL_STRGIN2                        *((volatile unsigned int*)(0x424E0708UL))
#define bM0P_ADC_ADCSTSL_STRGIN3                        *((volatile unsigned int*)(0x424E070CUL))
#define bM0P_ADC_ADCPTSL_PTRGIN0                        *((volatile unsigned int*)(0x424E0720UL))
#define bM0P_ADC_ADCPTSL_PTRGIN1                        *((volatile unsigned int*)(0x424E0724UL))
#define bM0P_ADC_ADCPTSL_PTRGIN2                        *((volatile unsigned int*)(0x424E0728UL))
#define bM0P_ADC_ADCPTSL_PTRGIN3                        *((volatile unsigned int*)(0x424E072CUL))
#define bM0P_ADC_ADEN_AD_EN                             *((volatile unsigned int*)(0x424E0780UL))
#define bM0P_ADC_ADEN_ENRDY                             *((volatile unsigned int*)(0x424E0784UL))
#define bM0P_ADC_ADEN_ENTM0                             *((volatile unsigned int*)(0x424E07A0UL))
#define bM0P_ADC_ADEN_ENTM1                             *((volatile unsigned int*)(0x424E07A4UL))
#define bM0P_ADC_ADEN_ENTM2                             *((volatile unsigned int*)(0x424E07A8UL))
#define bM0P_ADC_ADEN_ENTM3                             *((volatile unsigned int*)(0x424E07ACUL))
#define bM0P_ADC_ADEN_ENTM4                             *((volatile unsigned int*)(0x424E07B0UL))
#define bM0P_ADC_ADEN_ENTM5                             *((volatile unsigned int*)(0x424E07B4UL))
#define bM0P_ADC_ADEN_ENTM6                             *((volatile unsigned int*)(0x424E07B8UL))
#define bM0P_ADC_ADEN_ENTM7                             *((volatile unsigned int*)(0x424E07BCUL))
#define bM0P_ADC_ADRCMPCTL_RCMPEN                       *((volatile unsigned int*)(0x424E0908UL))
#define bM0P_ADC_ADRCMPCTL_RCMPTRG                      *((volatile unsigned int*)(0x424E0910UL))
#define bM0P_ADC_ADRCMPCTL_RCMPCNT0                     *((volatile unsigned int*)(0x424E0914UL))
#define bM0P_ADC_ADRCMPCTL_RCMPCNT1                     *((volatile unsigned int*)(0x424E0918UL))
#define bM0P_ADC_ADRCMPCTL_RCMPCNT2                     *((volatile unsigned int*)(0x424E091CUL))
#define bM0P_ADC_ADRCMPCTL_RCMPCN_ST0                   *((volatile unsigned int*)(0x424E0934UL))
#define bM0P_ADC_ADRCMPCTL_RCMPCN_ST1                   *((volatile unsigned int*)(0x424E0938UL))
#define bM0P_ADC_ADRCMPCTL_RCMPCN_ST2                   *((volatile unsigned int*)(0x424E093CUL))
#define bM0P_ADC_ADRCMPS_RCMPCH0                        *((volatile unsigned int*)(0x424E0980UL))
#define bM0P_ADC_ADRCMPS_RCMPCH1                        *((volatile unsigned int*)(0x424E0984UL))
#define bM0P_ADC_ADRCMPS_RCMPCH2                        *((volatile unsigned int*)(0x424E0988UL))
#define bM0P_ADC_ADRCMPS_RCMPCH3                        *((volatile unsigned int*)(0x424E098CUL))
#define bM0P_ADC_ADRCMPS_RCMPCH4                        *((volatile unsigned int*)(0x424E0990UL))
#define bM0P_ADC_ADRCMPS_RCMPMD                         *((volatile unsigned int*)(0x424E0994UL))
#define bM0P_ADC_ADRCMPL_CDL0                           *((volatile unsigned int*)(0x424E0A18UL))
#define bM0P_ADC_ADRCMPL_CDL1                           *((volatile unsigned int*)(0x424E0A1CUL))
#define bM0P_ADC_ADRCMPL_CDL2                           *((volatile unsigned int*)(0x424E0A20UL))
#define bM0P_ADC_ADRCMPL_CDL3                           *((volatile unsigned int*)(0x424E0A24UL))
#define bM0P_ADC_ADRCMPL_CDL4                           *((volatile unsigned int*)(0x424E0A28UL))
#define bM0P_ADC_ADRCMPL_CDL5                           *((volatile unsigned int*)(0x424E0A2CUL))
#define bM0P_ADC_ADRCMPL_CDL6                           *((volatile unsigned int*)(0x424E0A30UL))
#define bM0P_ADC_ADRCMPL_CDL7                           *((volatile unsigned int*)(0x424E0A34UL))
#define bM0P_ADC_ADRCMPL_CDL8                           *((volatile unsigned int*)(0x424E0A38UL))
#define bM0P_ADC_ADRCMPL_CDL9                           *((volatile unsigned int*)(0x424E0A3CUL))
#define bM0P_ADC_ADRCMPH_CDH0                           *((volatile unsigned int*)(0x424E0A58UL))
#define bM0P_ADC_ADRCMPH_CDH1                           *((volatile unsigned int*)(0x424E0A5CUL))
#define bM0P_ADC_ADRCMPH_CDH2                           *((volatile unsigned int*)(0x424E0A60UL))
#define bM0P_ADC_ADRCMPH_CDH3                           *((volatile unsigned int*)(0x424E0A64UL))
#define bM0P_ADC_ADRCMPH_CDH4                           *((volatile unsigned int*)(0x424E0A68UL))
#define bM0P_ADC_ADRCMPH_CDH5                           *((volatile unsigned int*)(0x424E0A6CUL))
#define bM0P_ADC_ADRCMPH_CDH6                           *((volatile unsigned int*)(0x424E0A70UL))
#define bM0P_ADC_ADRCMPH_CDH7                           *((volatile unsigned int*)(0x424E0A74UL))
#define bM0P_ADC_ADRCMPH_CDH8                           *((volatile unsigned int*)(0x424E0A78UL))
#define bM0P_ADC_ADRCMPH_CDH9                           *((volatile unsigned int*)(0x424E0A7CUL))
#define bM0P_ADC_ADRCMPF_RCMPF                          *((volatile unsigned int*)(0x424E0A80UL))
#define bM0P_CLOCK_CTRL_HC_EN                           *((volatile unsigned int*)(0x42200000UL))
#define bM0P_CLOCK_CTRL_MAIN_EN                         *((volatile unsigned int*)(0x42200004UL))
#define bM0P_CLOCK_CTRL_SUB_EN                          *((volatile unsigned int*)(0x4220000CUL))
#define bM0P_CLOCK_CTRL_PLL_EN                          *((volatile unsigned int*)(0x42200010UL))
#define bM0P_CLOCK_CTRL_INPUT0                          *((volatile unsigned int*)(0x42200014UL))
#define bM0P_CLOCK_CTRL_INPUT1                          *((volatile unsigned int*)(0x42200018UL))
#define bM0P_CLOCK_CTRL_INPUT2                          *((volatile unsigned int*)(0x4220001CUL))
#define bM0P_CLOCK_CLK_STB_HC_RDY                       *((volatile unsigned int*)(0x42200080UL))
#define bM0P_CLOCK_CLK_STB_MAIN_RDY                     *((volatile unsigned int*)(0x42200084UL))
#define bM0P_CLOCK_CLK_STB_SUB_RDY                      *((volatile unsigned int*)(0x4220008CUL))
#define bM0P_CLOCK_CLK_STB_PLL_RDY                      *((volatile unsigned int*)(0x42200090UL))
#define bM0P_CLOCK_CLK_STB_SRC0                         *((volatile unsigned int*)(0x42200094UL))
#define bM0P_CLOCK_CLK_STB_SRC1                         *((volatile unsigned int*)(0x42200098UL))
